#+INCLUDE: ~/org/blog/development/header.org
** ConfigMap

Here, instead of hard-coding an ip address for the pod our deployment will create, we're going to reference the subsequent service that gets created. We will need this in our node application in order to access mongo.

#+begin_src kubectl :action apply :tangle mongo-config.yaml :exports both
  # mongo-config.yaml
  apiVersion: v1
  kind: ConfigMap
  metadata:
    name: mongo-config
  data:
    mongo-url: mongo-service # to be created
#+end_src

#+RESULTS:
: configmap/mongo-config created

** Service

This service tells us what port we want to access the service through as well as which port to target and specifies a selector we will use to match in our deployment.

#+begin_src kubectl :action apply :tangle mongo.yaml :exports both
  # mongo-config.yaml
  ---
  apiVersion: v1
  kind: Service
  metadata:
    name: mongo-service
  spec:
    selector:
      app: mongo
    ports:
      - protocol: TCP
        port: 27017
        targetPort: 27017 # the container port we are targeting when our service gets a request
#+end_src

#+RESULTS:
: service/mongo-service created

** Deployment

In this deployment, we make sure to match up with the mongo service through the =matchLabels= selector and we configure the environmental variables of our mongo container. This information used therein is referenced from the [[https://hub.docker.com/_/mongo][official mongodb documentation on dockerhub]].

#+begin_src kubectl :action apply :tangle mongo.yaml :exports both
  # mongo.yaml
  apiVersion: apps/v1
  kind: Deployment
  metadata:
    name: mongo-deployment
    labels:
      app: mongo
  spec:
    replicas: 1
    selector:
      matchLabels:
        app: mongo # matched from our selector in our service
    template:
      metadata:
        labels:
          app: mongo
      spec:
        containers:
        - name: mongodb
          image: mongo:5.0
          ports:
          - containerPort: 27017 # we forward traffic here from our service
          env:
          - name: MONGO_INITDB_ROOT_USERNAME
            valueFrom:
              secretKeyRef:
                name: mongo-secret
                key: mongo-user
          - name: MONGO_INITDB_ROOT_PASSWORD
            valueFrom:
              secretKeyRef:
                name: mongo-secret
                key: mongo-password
#+end_src

#+RESULTS:
: deployment.apps/mongo-deployment created

Next we'll move onto the Setting up the node app.
** Service

This service will give us access to our web application through =minikube= via the =minikube ip=. We define the =nodePort= as accessible to the outside. Note that Services of type =NodePort= have to fall within a very specific range (30000-32767).

#+begin_src kubectl :action apply :tangle webapp.yaml :exports both
  # webapp.yaml
  ---
  apiVersion: v1
  kind: Service
  metadata:
    name: webapp-service
  spec:
    type: NodePort
    selector:
      app: webapp
    ports:
      - protocol: TCP
        port: 3000
        targetPort: 3000
        nodePort: 30100
#+end_src

#+RESULTS:
: service/webapp-service created

** Deployment

In this deployment, we make sure to match up with the webapp service through the =matchLabels= selector and we configure the environmental variables and read the values from our config map and secret.

#+begin_src kubectl :action apply :tangle webapp.yaml :exports both
  # webapp.yaml
  apiVersion: apps/v1
  kind: Deployment
  metadata:
    name: webapp-deployment
    labels:
      app: webapp
  spec:
    replicas: 2
    selector:
      matchLabels:
        app: webapp # matched from our selector in our service
    template:
      metadata:
        labels:
          app: webapp
      spec:
        containers:
        - name: webapp
          image: nanajanashia/k8s-demo-app:v1.0
          ports:
          - containerPort: 3000
          env:
          - name: USER_NAME
            valueFrom:
              secretKeyRef:
                name: mongo-secret
                key: mongo-user
          - name: USER_PWD
            valueFrom:
              secretKeyRef:
                name: mongo-secret
                key: mongo-password
          - name: DB_URL
            valueFrom:
              configMapKeyRef:
                name: mongo-config
                key: mongo-url
#+end_src

#+RESULTS:
: deployment.apps/webapp-deployment created


